Revit 2024 API
RebarContainer.RemoveItem Method
 Removes Item from the Rebar Container.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void RemoveItem(
	RebarContainerItem pItem
)
Visual Basic
Public Sub RemoveItem ( _
	pItem As RebarContainerItem _
)
Visual C++
public:
void RemoveItem(
	RebarContainerItem^ pItem
)
Parameters
pItem
Type: Autodesk.Revit.DB.Structure.RebarContainerItem
 Item to be removed from this Rebar Container
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The item is not a member of this Rebar Container element.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace